"""
בהינתן שני מערכים לא ריקים של מספרים שלמים, כתוב פונקציה שקובעת אם המערך השני הוא רצף משנה של הראשון.
רצף משנה של מערך הוא אוסף של מספרים שאינם בהכרח סמוכים במערך, אך נמצאים באותו סדר כפי שהם מופיעים במערך.
לדוגמה, המספרים [1, 3, 4] יוצרים רצף משנה של המערך [1, 2, 3, 4], וכך המספרים [2, 4].
שימו לב שמספר בודד במערך והמערך עצמו הם שניהם תתי-רצפים חוקיים של המערך.
"""


def is_subsequence(array: list, sequence: list):
    pass


arr = [5, 1, 22, 25, 6, -1, 8, 10]
seq = [1, 6, -1, 10]

print(f'is_subsequence({arr}, {seq}) = {is_subsequence(arr, seq)}')  # Prints True
